Repository: zziri/cmux
Catalog: Resources/Localizable.xcstrings
Source language: en
Languages: ar, bs, da, de, es, fr, it, ja, ko, nb, pl, pt_br, ru, th, tr, uk, zh_hans, zh_hant

# cli.browser.cookies.invalidFilter
source: browser cookies clear received an invalid cookie filter
ar: تلقى browser cookies clear تصفية ملف تعريف ارتباط غير صالحة
de: browser cookies clear hat einen ungültigen Cookie-Filter empfangen
es: browser cookies clear recibió un filtro de cookies no válido
fr: browser cookies clear a reçu un filtre de cookie non valide
ja: browser cookies clear に無効な Cookie フィルターが指定されました
ko: browser cookies clear가 올바르지 않은 쿠키 필터를 수신했습니다.
zh_hans: browser cookies clear 收到了无效的 cookie 过滤条件
zh_hant: browser cookies clear 收到無效的 cookie 篩選器

# cli.browser.cookies.invalidURL
source: browser cookies clear --url requires a valid URL with a host
ar: يتطلب browser cookies clear --url عنوان URL صالحًا مع مضيف
de: browser cookies clear --url erfordert eine gültige URL mit einem Host
es: browser cookies clear --url requiere una URL válida con un host
fr: browser cookies clear --url requiert une URL valide contenant un hôte
ja: browser cookies clear --url にはホストを含む有効な URL を指定してください
ko: browser cookies clear --url에는 호스트가 포함된 유효한 URL이 필요합니다.
zh_hans: browser cookies clear --url 需要一个带主机名的有效 URL
zh_hant: browser cookies clear --url 需要包含主機的有效 URL

# cli.browser.error.tabManagerUnavailable
source: Browser controls are unavailable
ar: عناصر التحكم في المتصفح غير متوفرة
de: Browser-Steuerelemente sind nicht verfügbar
es: Los controles del navegador no están disponibles
fr: Les commandes du navigateur ne sont pas disponibles
ja: ブラウザ機能を利用できません
ko: 브라우저 컨트롤을 사용할 수 없습니다.
zh_hans: 浏览器控制不可用
zh_hant: 瀏覽器控制項不可用

# cli.browser.error.viewportRequiresSizeOrReset
source: browser viewport requires: <width> <height> | reset
ar: يتطلب browser viewport: <width> <height> | reset
de: Browser-Viewport erfordert: <width> <height> | reset
es: browser viewport requiere: <width> <height> | reset
fr: browser viewport requiert : <width> <height> | reset
ja: browser viewport には <width> <height> または reset が必要です
ko: browser viewport에는 <width> <height> 또는 reset이 필요합니다.
zh_hans: browser viewport 需要：<width> <height> | reset
zh_hant: browser viewport 需要：<width> <height> | reset

# cli.browser.error.viewportResetAdditionalArguments
source: browser viewport reset does not accept additional arguments
ar: لا يقبل browser viewport reset وسيطات إضافية
de: Browser-Viewport-Reset akzeptiert keine zusätzlichen Argumente
es: browser viewport reset no acepta argumentos adicionales
fr: browser viewport reset n'accepte aucun argument supplémentaire
ja: browser viewport reset は追加の引数を受け付けません
ko: browser viewport reset은 추가 인수를 허용하지 않습니다.
zh_hans: browser viewport reset 不接受额外参数
zh_hant: browser viewport reset 不接受額外引數

# cli.browser.help.keyboardNaming
source: Named keys follow Playwright/W3C names. Space, Spacebar, and space emit DOM key " " with code "Space"; --key ' ' passes the raw DOM key.
ar: تتبع المفاتيح المسماة أسماء Playwright/W3C. يصدر Space و Spacebar و space مفتاح DOM " " برمز "Space"؛ ويمرر --key ' ' مفتاح DOM الخام.
de: Benannte Tasten folgen den Playwright/W3C-Namen. Space, Spacebar und space senden die DOM-Taste " " mit dem Code "Space"; --key ' ' übergibt die rohe DOM-Taste.
es: Las teclas con nombre siguen los nombres de Playwright/W3C. Space, Spacebar y space emiten la tecla DOM " " con el código "Space"; --key ' ' pasa la tecla DOM sin procesar.
fr: Les touches nommées suivent les noms de Playwright/W3C. Space, Spacebar et space émettent la touche DOM " " avec le code "Space" ; --key ' ' transmet la touche DOM brute.
ja: 名前付きキーは Playwright/W3C の名前に従います。Space、Spacebar、space は DOM key " " と code "Space" を送信し、--key ' ' では生の DOM key を渡せます。
ko: 이름이 지정된 키는 Playwright/W3C 이름을 따릅니다. Space, Spacebar 및 space는 "Space" 코드와 함께 DOM 키 " "를 생성하며, --key ' '는 원시 DOM 키를 전달합니다.
zh_hans: 具名按键遵循 Playwright/W3C 命名。Space、Spacebar 和 space 会发出 DOM key " "，code 为 "Space"；--key ' ' 则直接传递原始 DOM key。
zh_hant: 具名按鍵遵循 Playwright/W3C 名稱。Space、Spacebar 和 space 會發出 DOM 鍵 " "，其 code 為 "Space"；--key ' ' 則傳遞原始 DOM 鍵。

# cli.browser.help.viewportEmulationDescription
source: Emulate an exact 1...4096 CSS-pixel viewport inside the pane without resizing it
ar: محاكاة منفذ عرض بدقة بكسل CSS تتراوح بين 1...4096 داخل الجزء دون تغيير حجمه
de: Emuliert einen exakten CSS-Pixel-Viewport von 1...4096 im Teilfenster, ohne dessen Größe zu ändern
es: Emula un viewport exacto de 1...4096 píxeles CSS dentro del panel sin cambiar su tamaño
fr: Émuler une zone d’affichage CSS d’exactement 1...4096 pixels à l’intérieur du volet sans le redimensionner
ja: ペインのサイズを変更せず、正確な 1...4096 CSS ピクセルのビューポートをエミュレートします
ko: 크기를 조정하지 않고 분할 창 내부에서 정확히 1...4096 CSS 픽셀의 뷰포트를 에뮬레이션합니다.
zh_hans: 在窗格内模拟精确的 1...4096 CSS 像素视口，而不改变窗格大小
zh_hant: 在不調整窗格大小的情況下，於窗格內模擬精確的 1...4096 CSS 像素檢視區

# cli.browser.help.viewportPresentationDescription
source: The page is aspect-fitted in the existing pane; reset restores native pane sizing
ar: يتم ملائمة الصفحة مع الحفاظ على نسبة العرض إلى الارتفاع في الجزء الحالي؛ ويعيد reset حجم الجزء الأصلي
de: Die Seite wird seitenverhältnistreu in das bestehende Teilfenster eingepasst; Reset stellt die native Teilfenstergröße wieder her
es: La página se ajusta a la relación de aspecto en el panel existente; reset restaura el tamaño nativo del panel
fr: La page est ajustée au format dans le volet existant ; la réinitialisation rétablit la taille d’origine du volet
ja: ページは既存のペイン内にアスペクトフィットされ、reset でペイン本来のサイズに戻ります
ko: 페이지가 기존 분할 창에 가로세로 비율에 맞춰 채워집니다. reset은 원래의 분할 창 크기를 복원합니다.
zh_hans: 页面会按比例适配到现有窗格中；reset 可恢复窗格的原生尺寸
zh_hant: 頁面會依比例適應現有的窗格；reset 會還原為原始的窗格尺寸

# cli.browser.help.viewportRenderLimitDescription
source: Oversized viewport and page-zoom combinations return structured render-limit details
ar: ترجع تركيبات منفذ العرض وتكبير الصفحة ذات الحجم الكبير تفاصيل منظمة لحدود التصيير
de: Kombinationen aus übergroßem Viewport und Seiten-Zoom geben strukturierte Details zum Rendering-Limit zurück
es: Las combinaciones de viewport de gran tamaño y zoom de página devuelven detalles estructurados del límite de renderizado
fr: Les combinaisons de zones d’affichage surdimensionnées et de zooms de page renvoient des détails structurés sur les limites de rendu
ja: 大きすぎるビューポートとページズームの組み合わせでは、レンダリング上限の詳細が構造化形式で返されます
ko: 규격을 초과하는 뷰포트 및 페이지 배율 조합은 구조화된 렌더링 한계 상세 정보를 반환합니다.
zh_hans: 视口与页面缩放的组合过大时，会返回结构化的渲染上限详情
zh_hant: 超出大小的檢視區與頁面縮放組合將傳回結構化的轉譯限制詳細資訊

# cli.browser.profile.error.emptySelector
source: --profile requires a non-empty profile name or UUID
ar: يتطلب --profile اسم ملف تعريف غير فارغ أو معرف UUID
de: --profile erfordert einen nicht-leeren Profilnamen oder eine nicht-leere UUID
es: --profile requiere un nombre de perfil o UUID que no esté vacío
fr: --profile requiert un nom de profil ou un UUID non vide
ja: --profile には空でないプロファイル名または UUID が必要です
ko: --profile에는 비어 있지 않은 프로필 이름 또는 UUID가 필요합니다.
zh_hans: --profile 需要非空的配置文件名称或 UUID
zh_hant: --profile 需要非空白的設定檔名稱或 UUID

# cli.browser.profile.error.navigateUnsupported
source: --profile is only supported when browser open creates a new pane; omit the surface selector
ar: يتم دعم --profile فقط عندما ينشئ browser open جزءًا جديدًا؛ احذف محدد السطح
de: --profile wird nur unterstützt, wenn das Öffnen des Browsers ein neues Teilfenster erstellt; lassen Sie den Oberflächen-Selektor weg
es: --profile solo se admite cuando browser open crea un panel nuevo; omite el selector de superficie
fr: --profile est uniquement pris en charge lorsque l'ouverture d'un navigateur crée un nouveau volet ; omettez le sélecteur de surface d’affichage
ja: --profile は browser open が新しいペインを作成する場合にのみ使用できます。サーフェスセレクターを省略してください
ko: --profile은 브라우저 열기가 새 분할 창을 생성할 때만 지원됩니다. 화면 선택기를 생략하세요.
zh_hans: --profile 仅在 browser open 创建新窗格时受支持；请省略 surface 选择器
zh_hant: 僅在 browser open 建立新窗格時才支援 --profile；請省略介面選擇器

# cli.browser.profiles.marker.lastUsed
source: last used
ar: آخر استخدام
de: zuletzt verwendet
es: último usado
fr: dernier utilisé
ja: 前回使用
ko: 마지막 사용
zh_hans: 最近使用
zh_hant: 上次使用

# cli.canvas.error.invalidPaneType
source: type must be terminal, browser, or simulator
ar: يجب أن يكون النوع terminal أو browser أو simulator
de: Typ muss terminal, browser oder simulator sein
es: el tipo debe ser terminal, browser o simulator
fr: le type doit être terminal, browser, ou simulator
ja: typeにはterminal、browser、simulatorのいずれかを指定してください
ko: type은 terminal, browser 또는 simulator 중 하나여야 합니다.
zh_hans: type 必须为 terminal、browser 或 simulator
zh_hant: type 必須是 terminal、browser 或 simulator

# cli.canvas.error.newPaneTypeUsage
source: Usage: cmux canvas new-pane [--type terminal|browser|simulator]
ar: الاستخدام: cmux canvas new-pane [--type terminal|browser|simulator]
de: Verwendung: cmux canvas new-pane [--type terminal|browser|simulator]
es: Uso: cmux canvas new-pane [--type terminal|browser|simulator]
fr: Utilisation : cmux canvas new-pane [--type terminal|browser|simulator]
ja: 使用方法: cmux canvas new-pane [--type terminal|browser|simulator]
ko: 사용법: cmux canvas new-pane [--type terminal|browser|simulator]
zh_hans: 用法：cmux canvas new-pane [--type terminal|browser|simulator]
zh_hant: 用法：cmux canvas new-pane [--type terminal|browser|simulator]

# cli.claude-hook.error.invalidSurface
source: Invalid surface handle: %@
ar: مقبض سطح غير صالح: %@
de: Ungültiges Oberflächen-Handle: %@
es: Identificador de superficie no válido: %@
fr: Descripteur de surface d’affichage non valide : %@
ja: 無効なサーフェスハンドル: %@
ko: 올바르지 않은 화면 핸들: %@
zh_hans: 无效的表面句柄：%@
zh_hant: 無效的介面控點：%@

# cli.claude-hook.error.surfaceNotFound
source: Surface not found: %@
ar: السطح غير موجود: %@
de: Oberfläche nicht gefunden: %@
es: Superficie no encontrada: %@
fr: Surface d’affichage introuvable : %@
ja: サーフェスが見つかりません: %@
ko: 화면을 찾을 수 없음: %@
zh_hans: 未找到表面：%@
zh_hant: 找不到介面：%@

# cli.claude-teams.usage
source: Usage: cmux claude-teams [claude-args...] Launch Claude Code with agent teams enabled. This command: - defaults Claude teammate mode to auto - sets a tmux-like environment so Claude auto mode uses cmux splits - sets CLAUDE_CODE_EXPERIMENTAL_AGENT_TEAMS=1 - prepends a private tmux shim to PATH - forwards all remaining arguments to claude The tmux shim translates supported tmux window/pane commands into cmux workspace and split operations in the current cmux session. Examples: cmux claude-teams cmux claude-teams --continue cmux claude-teams --model sonnet
ar: الاستخدام: cmux claude-teams [claude-args...] تشغيل Claude Code مع تمكين فرق الوكلاء. هذا الأمر: - يضبط وضع زميل العمل في Claude افتراضيًا على auto - يضبط بيئة شبيهة بـ tmux بحيث يستخدم وضع Claude التلقائي تقسيمات cmux - يضبط CLAUDE_CODE_EXPERIMENTAL_AGENT_TEAMS=1 - يضيف shim tmux خاصًا إلى بداية PATH - يوجه جميع الوسيطات المتبقية إلى claude يقوم shim tmux بترجمة أوامر نافذة/جزء tmux المدعومة إلى cmux عمليات مساحة عمل وتقسيم في جلسة cmux الحالية. أمثلة: cmux claude-teams cmux claude-teams --continue cmux claude-teams --model sonnet
de: Verwendung: cmux claude-teams [claude-args...] Startet Claude Code mit aktivierten Agenten-Teams. Dieser Befehl: - setzt den Claude-Teammate-Modus standardmäßig auf auto - richtet eine tmux-ähnliche Umgebung ein, sodass der Claude-Auto-Modus cmux-Aufteilungen verwendet - setzt CLAUDE_CODE_EXPERIMENTAL_AGENT_TEAMS=1 - stellt einen privaten tmux-Shim PATH voran - leitet alle verbleibenden Argumente an claude weiter Der tmux-Shim übersetzt unterstützte tmux-Fenster-/Teilfensterbefehle in cmux- Arbeitsbereichs- und Aufteilungsoperationen in der aktuellen cmux-Sitzung. Beispiele: cmux claude-teams cmux claude-teams --continue cmux claude-teams --model sonnet
es: Uso: cmux claude-teams [claude-args...] Inicia Claude Code con equipos de agentes habilitados. Este comando: - establece por defecto el modo de compañero de equipo de Claude en auto - establece un entorno similar a tmux para que el modo auto de Claude use divisiones de cmux - establece CLAUDE_CODE_EXPERIMENTAL_AGENT_TEAMS=1 - antepone un shim de tmux privado a PATH - reenvía todos los argumentos restantes a claude El shim de tmux traduce los comandos de ventana/panel de tmux admitidos a cmux operaciones de espacio de trabajo y división en la sesión actual de cmux. Ejemplos: cmux claude-teams cmux claude-teams --continue cmux claude-teams --model sonnet
fr: Utilisation : cmux claude-teams [claude-args...] Lancez Claude Code avec les équipes d’agents activées. Cette commande : - définit par défaut le mode coéquipier de Claude sur auto - configure un environnement de type tmux afin que le mode auto de Claude utilise les divisions cmux - définit CLAUDE_CODE_EXPERIMENTAL_AGENT_TEAMS=1 - ajoute un shim tmux privé au début de PATH - transfère tous les arguments restants à claude Le shim tmux traduit les commandes de fenêtre/volet tmux prises en charge en opérations d'espace de travail et de division cmux dans la session cmux actuelle. Exemples : cmux claude-teams cmux claude-teams --continue cmux claude-teams --model sonnet
ja: 使用方法: cmux claude-teams [claude-args...] エージェントチームを有効にして Claude Code を起動します。 このコマンドは以下を行います: - Claude のチームメイトモードのデフォルトを auto に設定 - Claude の auto モードが cmux の分割を使用するように tmux 風の環境を設定 - CLAUDE_CODE_EXPERIMENTAL_AGENT_TEAMS=1 を設定 - PATH の先頭にプライベートな tmux シムを追加 - 残りのすべての引数を claude に転送 この tmux シムは、サポートされている tmux の window/pane コマンドを cmux の 現在の cmux セッションにおけるワークスペースおよび分割操作に変換します。 例: cmux claude-teams cmux claude-teams --continue cmux claude-teams --model sonnet
ko: 사용법: cmux claude-teams [claude-args...] 에이전트 팀이 활성화된 상태로 Claude Code를 실행합니다. 이 명령은: - Claude 팀원 모드를 auto로 설정합니다 - Claude auto 모드가 cmux 분할을 사용하도록 tmux 호환 환경을 설정합니다 - CLAUDE_CODE_EXPERIMENTAL_AGENT_TEAMS=1을 설정합니다 - PATH 앞에 전용 tmux 심을 추가합니다 - 나머지 인자를 모두 claude에 전달합니다 tmux 심은 지원되는 tmux 윈도우/패인 명령을 현재 cmux 세션의 워크스페이스 및 분할 작업으로 변환합니다. 예시: cmux claude-teams cmux claude-teams --continue cmux claude-teams --model sonnet
uk: Використання: cmux claude-teams [аргументи-claude...] Запуск Claude Code з увімкненими командами агентів. Ця команда: - типово вмикає режим teammate для Claude - забезпечує підтримку cmux для сеансу - встановлює CLAUDE_CODE_EXPERIMENTAL_AGENT_TEAMS=1 - додає приватну tmux-прокладку на початок PATH - передає всі інші аргументи до claude Tmux-прокладка перетворює підтримувані команди tmux вікон/панелей на операції робочих просторів і розділів cmux у поточному сеансі cmux. Приклади: cmux claude-teams cmux claude-teams --continue cmux claude-teams --model sonnet
zh_hans: 用法：cmux claude-teams [claude-args...] 启动 Claude Code 并启用 agent teams。 此命令会： - 将 Claude teammate 模式默认设为 auto - 设置类 tmux 环境，使 Claude auto 模式使用 cmux 拆分 - 设置 CLAUDE_CODE_EXPERIMENTAL_AGENT_TEAMS=1 - 将私有 tmux shim 前置到 PATH - 将其余所有参数转发给 claude tmux shim 会把受支持的 tmux window/pane 命令，转换为当前 cmux 会话中的 工作区和拆分操作。 示例： cmux claude-teams cmux claude-teams --continue cmux claude-teams --model sonnet
zh_hant: 用法：cmux claude-teams [claude-args...] 在啟用代理團隊的情況下啟動 Claude Code。 此命令： - 將 Claude 隊友模式預設為 auto - 設定類 tmux 環境，使 Claude 的 auto 模式使用 cmux 分割 - 設定 CLAUDE_CODE_EXPERIMENTAL_AGENT_TEAMS=1 - 將私有 tmux 墊片 (shim) 新增至 PATH 的前端 - 將所有剩餘的引數轉發給 claude tmux 墊片會將支援的 tmux 視窗/窗格命令轉換為 cmux 目前 cmux 工作階段中的工作區與分割操作。 範例： cmux claude-teams cmux claude-teams --continue cmux claude-teams --model sonnet

# cli.closeSurface.error.explicitSurfaceRequiresWorkspaceOrWindow
source: close-surface requires --workspace or --window with explicit --surface
ar: يتطلب close-surface الخيار --workspace أو --window عند تحديد --surface صراحةً
bs: close-surface zahtijeva --workspace ili --window uz eksplicitni --surface
da: close-surface kræver --workspace eller --window med eksplicit --surface
de: close-surface erfordert --workspace oder --window mit explizitem --surface
es: close-surface requiere --workspace o --window con --surface explícito
fr: close-surface requiert --workspace ou --window avec --surface explicite
it: close-surface richiede --workspace o --window con --surface esplicito
ja: 明示的に --surface を指定する場合、close-surface には --workspace または --window が必要です
ko: 명시적 --surface에는 close-surface에 --workspace 또는 --window가 필요합니다
nb: close-surface krever --workspace eller --window med eksplisitt --surface
pl: close-surface wymaga --workspace albo --window przy jawnym --surface
pt_br: close-surface requer --workspace ou --window com --surface explícito
ru: close-surface требует --workspace или --window при явном --surface
th: close-surface ต้องใช้ --workspace หรือ --window เมื่อระบุ --surface อย่างชัดเจน
tr: Açık --surface ile close-surface için --workspace veya --window gerekir
uk: close-surface потребує --workspace або --window з явним --surface
zh_hans: 显式指定 --surface 时，close-surface 需要 --workspace 或 --window
zh_hant: 明確指定 --surface 時，close-surface 需要 --workspace 或 --window

# cli.cloud.domains.custom.details
source: id: %1$@ verification: %2$@ certificate: %3$@
ar: المعرف: %1$@ التحقق: %2$@ الشهادة: %3$@
de: id: %1$@ Verifizierung: %2$@ Zertifikat: %3$@
es: id: %1$@ verificación: %2$@ certificado: %3$@
fr: id : %1$@ vérification : %2$@ certificat : %3$@
ja: ID: %1$@ 検証: %2$@ 証明書: %3$@
ko: id: %1$@ 검증: %2$@ 인증서: %3$@
zh_hans: id: %1$@ 验证: %2$@ 证书: %3$@
zh_hant: id: %1$@ 驗證：%2$@ 憑證：%3$@

# cli.cloud.domains.custom.empty
source: No custom Cloud VM domains. Start one with `cmux cloud domains verify <domain>`.
ar: لا توجد نطاقات مخصصة لأجهزة Cloud VM. ابدأ واحدًا باستخدام `cmux cloud domains verify <domain>`.
de: Keine benutzerdefinierten Cloud-VM-Domains. Starten Sie eine mit `cmux cloud domains verify <domain>`.
es: No hay dominios de VM en la nube personalizados. Inicia uno con `cmux cloud domains verify <domain>`.
fr: Aucun domaine de VM Cloud personnalisé. Démarrez-en un avec `cmux cloud domains verify <domain>`.
ja: カスタム Cloud VM ドメインはありません。`cmux cloud domains verify <domain>` で開始してください。
ko: 사용자 지정 Cloud VM 도메인이 없습니다. `cmux cloud domains verify <domain>` 명령어로 시작하세요.
zh_hans: 没有自定义的 Cloud VM 域名。用 `cmux cloud domains verify <domain>` 添加一个。
zh_hant: 沒有自訂的雲端 VM 網域。使用 `cmux cloud domains verify <domain>` 開始一個。

# cli.cloud.domains.custom.noPublications
source: publications: none
ar: المنشورات: لا يوجد
de: Veröffentlichungen: keine
es: publicaciones: ninguna
fr: publications : aucune
ja: 公開: なし
ko: publications: 없음
zh_hans: 发布: 无
zh_hant: 發佈：無

# cli.cloud.domains.custom.publications
source: publications: %@
ar: المنشورات: %@
de: Veröffentlichungen: %@
es: publicaciones: %@
ja: 公開: %@
ko: 게시: %@
zh_hans: 发布: %@
zh_hant: 發佈：%@

# cli.cloud.domains.details
source: id: %1$@ vm: %2$@:%3$@ access: %4$@ state: %5$@ routing revision: %6$@ domain: %7$@
ar: المعرف: %1$@ vm: %2$@:%3$@ الوصول: %4$@ الحالة: %5$@ مراجعة التوجيه: %6$@ النطاق: %7$@
de: id: %1$@ vm: %2$@:%3$@ Zugriff: %4$@ Status: %5$@ Routing-Revision: %6$@ Domain: %7$@
es: id: %1$@ vm: %2$@:%3$@ acceso: %4$@ estado: %5$@ revisión de enrutamiento: %6$@ dominio: %7$@
fr: id : %1$@ vm : %2$@:%3$@ accès : %4$@ état : %5$@ révision du routage : %6$@ domaine : %7$@
ja: ID: %1$@ VM: %2$@:%3$@ アクセス: %4$@ 状態: %5$@ ルーティングリビジョン: %6$@ ドメイン: %7$@
ko: id: %1$@ vm: %2$@:%3$@ 액세스: %4$@ 상태: %5$@ 라우팅 리비전: %6$@ 도메인: %7$@
zh_hans: id: %1$@ vm: %2$@:%3$@ 访问: %4$@ 状态: %5$@ 路由版本: %6$@ 域名: %7$@
zh_hant: id: %1$@ vm: %2$@:%3$@ 存取權限：%4$@ 狀態：%5$@ 路由修訂版本：%6$@ 網域：%7$@

# cli.cloud.domains.dns.apexFallback
source: No ALIAS/ANAME/flattening record at your DNS provider? Publish www.%@ and redirect the apex to it.
ar: لا يوجد سجل ALIAS/ANAME/تسطيح لدى موفر خدمة DNS الخاص بك؟ انشر www.%@ وقم بتوجيه الأوج (apex) إليه.
de: Kein ALIAS-/ANAME- oder Flattening-Eintrag bei deinem DNS-Anbieter? Veröffentliche www.%@ und leite den Apex-Eintrag dorthin weiter.
es: ¿No tienes ningún registro ALIAS/ANAME/aplanamiento en tu proveedor de DNS? Publica www.%@ y redirige el apex a él.
fr: Pas d'enregistrement ALIAS/ANAME/flattening chez votre fournisseur DNS ? Publiez www.%@ et redirigez l'apex vers celui-ci.
ja: DNS プロバイダーに ALIAS/ANAME/フラット化レコードがない場合は、www.%@ を公開して apex からリダイレクトしてください。
ko: DNS 제공업체에 ALIAS/ANAME/flattening 레코드가 없습니까? www.%@ 레코드를 게시하고 apex를 이곳으로 리디렉션하세요.
zh_hans: 你的 DNS 服务商没有 ALIAS/ANAME/flattening 记录？请发布 www.%@ 并把裸域重定向到它。
zh_hant: 您的 DNS 供應商沒有 ALIAS/ANAME/扁平化 (flattening) 紀錄？請發佈 www.%@並將 apex 重新導向至該處。

# cli.cloud.domains.dns.certificate
source: certificate
ar: الشهادة
de: Zertifikat
es: certificado
fr: certificat
ja: 証明書
ko: 인증서
zh_hans: 证书
zh_hant: 憑證

# cli.cloud.domains.dns.header
source: Add these DNS records for %@:
ar: أضف سجلات DNS هذه لـ %@:
de: Füge diese DNS-Einträge für %@ hinzu:
es: Añade estos registros DNS para %@:
fr: Ajoutez ces enregistrements DNS pour %@ :
ja: %@ に次の DNS レコードを追加してください:
ko: %@에 대한 다음 DNS 레코드를 추가하십시오:
zh_hans: 请为 %@ 添加以下 DNS 记录:
zh_hant: 為 %@ 新增以下 DNS 紀錄：

# cli.cloud.domains.dns.ownership
source: ownership
ar: الملكية
de: Eigentum
es: propiedad
fr: propriété
ja: 所有権
ko: 소유권
zh_hans: 所有权
zh_hant: 所有權

# cli.cloud.domains.dns.routing
source: routing
ar: التوجيه
es: enrutamiento
fr: routage
ja: ルーティング
ko: 라우팅
zh_hans: 路由
zh_hant: 路由

# cli.cloud.domains.dns.routingNote
source: Routing: the apex record serves %@ itself; the * record serves every subdomain.
ar: التوجيه: يخدم سجل الأوج (apex) %@ نفسه؛ ويخدم السجل * كل نطاق فرعي.
de: Routing: Der Apex-Eintrag bedient %@ selbst; der *-Eintrag bedient jede Subdomain.
es: Enrutamiento: el registro apex sirve al propio %@; el registro * sirve a todos los subdominios.
fr: Routage : l'enregistrement apex dessert %@ lui-même ; l'enregistrement * dessert tous les sous-domaines.
ja: ルーティング: apex レコードは %@ 自体を、* レコードはすべてのサブドメインを配信します。
ko: 라우팅: apex 레코드는 %@ 자체를 처리하고, * 레코드는 모든 하위 도메인을 처리합니다.
zh_hans: 路由：裸域记录服务 %@ 本身；* 记录服务所有子域名。
zh_hant: 路由：apex 紀錄服務 %@ 本身；* 紀錄服務每個子網域。

# cli.cloud.domains.empty
source: No published Cloud VM domains.
ar: لا توجد نطاقات منشورة لأجهزة Cloud VM.
de: Keine veröffentlichten Cloud-VM-Domains.
es: No hay dominios de VM en la nube publicados.
fr: Aucun domaine de VM Cloud publié.
ja: 公開済みの Cloud VM ドメインはありません。
ko: 게시된 Cloud VM 도메인이 없습니다.
zh_hans: 没有已发布的 Cloud VM 域名。
zh_hant: 沒有已發佈的雲端 VM 網域。

# cli.cloud.domains.helpDescription
source: Publish VM ports on generated or custom domains.
ar: انشر منافذ VM على نطاقات تم إنشاؤها أو مخصصة.
de: Veröffentlichen Sie VM-Ports auf generierten oder benutzerdefinierten Domains.
es: Publica puertos de VM en dominios generados o personalizados.
fr: Publiez les ports de VM sur des domaines générés ou personnalisés.
ja: 生成ドメインまたはカスタムドメインで VM ポートを公開します。
ko: 생성된 도메인 또는 사용자 지정 도메인에 VM 포트를 게시합니다.
zh_hans: 在生成的域名或自定义域名上发布 VM 端口。
zh_hant: 在產生的或自訂的網域上發佈 VM 連接埠。

# cli.cloud.domains.invalidAccess
source: Access must be personal, team, or public.
ar: يجب أن يكون الوصول شخصيًا (personal) أو للفريق (team) أو عامًا (public).
de: Zugriff muss personal, team oder public sein.
es: El acceso debe ser personal, de equipo o público.
fr: L’accès doit être personal, team ou public.
ja: アクセスは personal、team、または public で指定してください。
ko: 액세스는 personal, team 또는 public 중 하나여야 합니다.
zh_hans: 访问级别必须是 personal、team 或 public。
zh_hant: 存取權限必須是 personal、team 或 public。

# cli.cloud.domains.malformedDomainResponse
source: The cmux app returned a domain response this CLI could not read.
ar: أرجع تطبيق cmux استجابة نطاق لم يتمكن واجهة خط الأوامر (CLI) من قراءتها.
de: Die cmux-App hat eine Domain-Antwort zurückgegeben, die diese CLI nicht lesen konnte.
es: La aplicación cmux devolvió una respuesta de dominio que esta CLI no pudo leer.
fr: L’application cmux a renvoyé une réponse de domaine que cette CLI n’a pas pu lire.
ja: cmux アプリから、この CLI では読み取れないドメインレスポンスが返されました。
ko: cmux 앱이 이 CLI에서 읽을 수 없는 도메인 응답을 반환했습니다.
zh_hans: cmux 应用返回的域名响应，本 CLI 无法解析。
zh_hant: cmux 應用程式傳回了此 CLI 無法讀取的網域回應。
